artillery.io/palindrom.yml
config:
  target: "http://localhost:8080/index"
  processor: "./palindrom.js"
  phases:
    - duration: 30
      arrivalRate: 50
  palindrom:
    timeout: 5000
scenarios:
  - engine: "palindrom"
    flow:
      # - function: "logPalindromModel"
      - updateModelFunction: "insertItem"
      # - function: "logPalindromModel"
      - think: 2
      - updateModelFunction: "setInsertedItemGuid"
      - updateModelFunction: "updateInsertedItem"
      # - function: "logPalindromModel"
      - think: 2
      - updateModelFunction: "deleteInsertedItem"
      # - function: "logPalindromModel"