artillery.io/palindrom.yml
config:
  target: "http://localhost:8080/index"
  processor: "./palindrom.js"
  phases:
    - duration: 10
      arrivalRate: 30
  palindrom:
    timeout: 10000
scenarios:
  - engine: "palindrom"
    weight: 99
    flow:
      - updateModelFunction: "insertItem"
      - updateModelFunction: "emptyTrigger"
      - function: "saveInsertedItemInfo"
      - morphUrl: "{{ EditInsertedItemUri }}"
      - updateModelFunction: "setEditedItemGuid"
      - updateModelFunction: "setEditedItemIndex"
      - think: 2
      - updateModelFunction: "saveEditedItem"
      - think: 2
      - morphUrl: "/index"
      - updateModelFunction: "deleteSavedItem"
  - engine: "palindrom"
    weight: 1
    flow:
      - think: 2
      - updateModelFunction: "emptyTrigger"
      - function: "logState"

      # - function: "logPalindromModel"
      # - think: 2
      # - updateModelFunction: "setInsertedItemGuid"
      # - updateModelFunction: "updateInsertedItem"
      # - function: "logPalindromModel"
      # - think: 2
      # - updateModelFunction: "deleteInsertedItem"
      # - function: "logPalindromModel"