artillery.io/palindrom.yml
config:
  target: "http://localhost:8080/index"
  processor: "./palindrom.js"
  phases:
    - duration: 3
      arrivalRate: 10
scenarios:
  - engine: "palindrom"
    flow:
      - function: "logPalindromModel"
      - function: "insertItem"
      - function: "setLastItemGuid"
      - function: "updateLastItem"
      - function: "logPalindromModel"