artillery.io/playground.nova-sc.yml
config:
  target: "http://localhost:8080"
  processor: "./playground.nova-sc.js"
  phases:
    - duration: 20
      arrivalRate: 100
  http:
    timeout: 20
scenarios:
  - name: "Insert / update / delete N items"
    weight: 39
    flow:
      - loop:
          - get:
              url: "/api/scitems"
              expect:
                - statusCode: 200
          - function: "setInsertItemData"
          - post:
              url: "/api/scitems"
              expect:
                - statusCode: 200
              json: "{{ InsertItem }}"
              capture:
                json: "$.Oid"
                as: "InsertedItemOid"
          - get: 
              url: "/api/scitems/{{ InsertedItemOid }}"
              expect:
                - statusCode: 200
              capture: 
                json: "$"
                as: "ViewItem"
          - think: 1
          - function: "setUpdateItemData"
          - put: 
              url: "/api/scitems"
              expect:
                - statusCode: 200
              json: "{{ UpdateItem }}"
          - think: 1
          - get:
              url: "/api/scitems"
              expect:
                - statusCode: 200
          - delete:
              url: "/api/scitems/{{ InsertedItemOid }}"
              expect:
                - statusCode: 200
        count: 20
  - name: "View N items"
    weight: 59
    flow:
      - loop:
          - get: 
              url: "/api/scitems"
              expect:
                - statusCode: 200
              capture:
                - json: "$"
                  as: "Items"
          - function: "setRandomItemOid"
          - get:
              url: "/api/scitems/{{ RandomItemOid }}"
              expect:
                - statusCode: 200
          - think: 1
          - get:
              url: "/api/scitems"
              expect:
                - statusCode: 200
        count: 20
  - name: "Log current number of items"
    weight: 2
    flow:
      - think: 2
      - get:
          url: "/api/scitems"
          expect:
            - statusCode: 200
          capture: 
            json: "$"
            as: "Items"
      - function: "setItemsLength"
      - log: "Total number of item: {{ ItemsLength }}"